/* 计科 2154146 吴金轩 */
#include <iostream>
using namespace std;

/***************************************************************************
  函数名称：f_sub
  功    能：输出传入的整形参数
  输入参数：int x：需要输出的整型数
  返 回 值：无
  说    明：无
***************************************************************************/
void f_sub(int x)
{
	cout << "x = " << x << endl;
}

/***************************************************************************
  函数名称：return_f_pointer
  功    能：输出传入的字符串参数，并返回f_sub的函数指针
  输入参数：const char* str：需要输出的字符串
  返 回 值：void (*p)(int)：f_sub的函数指针
  说    明：无
***************************************************************************/
void(* return_f_pointer(const char* str))(int)
{
	void (*p)(int);
	p = f_sub;
	cout << "str = " << str << endl;
	return p;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	void(*(*f[3])(const char* p))(int x);
	f[0] = return_f_pointer;

	f[0]("Hello")(2);
	f[0]("Tongji")(7);

	return 0;
}